### One Hot Encoding

✅ This creates a binary column for each category.

In [35]:
import pandas as pd

### Example 1

In [36]:
df0 = pd.read_csv("../../C_Datasets/titanic_train_original.csv")
df  = df0[['Sex', 'Embarked', 'Survived']]
df = df.dropna()
df.head()

      Sex Embarked  Survived
0    male        S         0
1  female        C         1
2  female        S         1
3  female        S         1
4    male        S         0

In [37]:
df['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [38]:
from sklearn.preprocessing import OneHotEncoder

In [39]:
ohe = OneHotEncoder(sparse_output=False).set_output(transform="pandas")

# set_output(transform="pandas") --> use to transform Pandas DataFrame

In [40]:
ohetransform = ohe.fit_transform(df[['Embarked']])

In [41]:
ohetransform

     Embarked_C  Embarked_Q  Embarked_S
0           0.0         0.0         1.0
1           1.0         0.0         0.0
2           0.0         0.0         1.0
3           0.0         0.0         1.0
4           0.0         0.0         1.0
..          ...         ...         ...
886         0.0         0.0         1.0
887         0.0         0.0         1.0
888         0.0         0.0         1.0
889         1.0         0.0         0.0
890         0.0         1.0         0.0

[889 rows x 3 columns]

In [51]:
ohe.categories_

[array(['C', 'Q', 'S'], dtype=object)]

In [47]:
ohetransform.columns = ohe.categories_[0]

In [49]:
df_final = pd.concat([df, ohetransform], axis='columns').drop(columns=['Embarked'])

In [50]:
df_final

        Sex  Survived    C    Q    S
0      male         0  0.0  0.0  1.0
1    female         1  1.0  0.0  0.0
2    female         1  0.0  0.0  1.0
3    female         1  0.0  0.0  1.0
4      male         0  0.0  0.0  1.0
..      ...       ...  ...  ...  ...
886    male         0  0.0  0.0  1.0
887  female         1  0.0  0.0  1.0
888  female         0  0.0  0.0  1.0
889    male         1  1.0  0.0  0.0
890    male         0  0.0  1.0  0.0

[889 rows x 5 columns]

### Example 2

In [69]:
df0 = pd.read_csv("../../C_Datasets/Co2_Emission.csv")
df0.head()

,MODELYEAR,MAKE,MODEL,VEHICLECLASS,ENGINESIZE,CYLINDERS,TRANSMISSION,FUELTYPE,FUELCONSUMPTION_CITY,FUELCONSUMPTION_HWY,FUELCONSUMPTION_COMB,FUELCONSUMPTION_COMB_MPG,CO2EMISSIONS
0,2014,ACURA,ILX,COMPACT,2.0,4,AS5,Z,9.9,6.7,8.5,33,196
1,2014,ACURA,ILX,COMPACT,2.4,4,M6,Z,11.2,7.7,9.6,29,221
2,2014,ACURA,ILX HYBRID,COMPACT,1.5,4,AV7,Z,6.0,5.8,5.9,48,136
3,2014,ACURA,MDX 4WD,SUV - SMALL,3.5,6,AS6,Z,12.7,9.1,11.1,25,255
4,2014,ACURA,RDX AWD,SUV - SMALL,3.5,6,AS6,Z,12.1,8.7,10.6,27,244

In [70]:
df0['FUELTYPE'].value_counts()

FUELTYPE
X    514
Z    434
E     92
D     27
Name: count, dtype: int64

In [65]:
ohe_2 = OneHotEncoder(sparse_output=False).set_output(transform='pandas')

In [75]:
df_fuel_type = ohe_2.fit_transform(df0[['FUELTYPE']])

In [76]:
df_fuel_type.columns = ohe_2.categories_[0]

In [77]:
df_fuel_type

        D    E    X    Z
0     0.0  0.0  0.0  1.0
1     0.0  0.0  0.0  1.0
2     0.0  0.0  0.0  1.0
3     0.0  0.0  0.0  1.0
4     0.0  0.0  0.0  1.0
...   ...  ...  ...  ...
1062  0.0  0.0  1.0  0.0
1063  0.0  0.0  1.0  0.0
1064  0.0  0.0  1.0  0.0
1065  0.0  0.0  1.0  0.0
1066  0.0  0.0  1.0  0.0

[1067 rows x 4 columns]